Repository: gisplatform/opensource
Catalog: libs/libgprpc/po/*.po
Languages: ru

source: Wrong RPC header size
ru: Неверный размер RPC-заголовка

source: Unknown RPC packet
ru: Неизвестный RPC-пакет

source: Wrong RPC data size
ru: Неверный размер данных RPC

source: RPC sequence mismatch
ru: Нарушена последовательность RPC

source: received
ru: получено

source: needed
ru: требуется

source: RPC data buffer error
ru: Ощибка буфера данных RPC

source: PRPC version mismatch
ru: Несовпадение версии RPC

source: client version
ru: версия клиента

source: server version
ru: версия сервера

source: RPC authentication method not supported
ru: Метод аутентификации RPC не поддерживается

source: RPC client was not authenticated
ru: RPC-клиент не был аутентифицирован

source: RPC Access denied
ru: Запрещен доступ по RPC

source: Unknown RPC procedure
ru: Неизвестная RPC-процедура

source: Unknown RPC object
ru: Неизвестный RPC-объект

source: Failed to determine protocol from URI.
ru: Не удалось определить протокол по URI.

source: Internal RPC auth parameter error.
ru: Внутренняя ошибка параметра аутентификации RPC.

source: Internal RPC manager parameter error.
ru: Внутренняя ошибка параметра менеджера RPC.

source: Failed to find protocol name in URI.
ru: Не удалось найти название протокола в URI.

source: Failed to create RPC control object.
ru: Не удалось создать управляющий объект RPC

source: Failed to create RPC server:
ru: Не удалось создать RPC-сервер:

source: Failed to create RPC client
ru: Не удалось создать RPC-клиента

source: RPC stop semaphore error.
ru: Ощибка стоп-семафора RPC.

source: Check of RPC header failed:
ru: Провалена проверка RPC-заголовка:

source: RPC client is not connected.
ru: RPC-клиент не подключен.

source: Can't authenticate.
ru: Невозможно аутентифицировать.

source: Can't execute RPC request:
ru: Не удалось выполнить RPC-запрос:

source: Authentication failed.
ru: Не удалась аутентификация.

source: Failed to get IP port from URI.
ru: Не удалось определить IP-порт по адресу.

source: RPC control thread failed.
ru: Ошибка управляющего потока RPC.

source: Wrong internal auth object.
ru: Некорректный внутренний объект аутентификации.

source: URI type is not TCP.
ru: Адрес не является TCP-адресом.

source: Fail to get address and port from URI.
ru: Не удалось определить IP-адрес и порт по адресу.

source: Failed to lock RPC.
ru: Блокировка RPC не удалась.

source: Authentication required.
ru: Требуется аутентификация.

source: Failed to send RPC data:
ru: Не удалось отправить данные RPC:

source: RPC data send timeout.
ru: Истек период ожидания отправки данных RPC.

source: Failed to receive RPC header:
ru: Не удалось принять RPC-заголовок:

source: RPC header receive timeout.
ru: Истек период ожидания приема RPC-заголовка.

source: RPC response too large.
ru: Ответ RPC слишком большой.

source: Failed to receive RPC data:
ru: Не удалось принять RPC-данные:

source: RPC data receive timeout.
ru: Истек период ожидания приема RPC-данных.

source: Failed to get IP address from URI.
ru: Не удалось определить IP-адрес по адресу.

source: URI type is not UDP.
ru: Адрес не является UDP-адресом.

source: Socket send failed:
ru: Не удалась отправка через сокет:

source: Socket receive failed:
ru: Не удался прием из сокета:
